
namespace ConsoleGame.Game
{
    /*
     
    Додати клас Player, який описує гравця консольної гри.

    Клас має зберігати наступну інформацію:
    — позиція гравця;
    - символ, яким буде позначатися гравець;
    - колір, яким має виводитись гравець (ConsoleColor).

    В класі реалізувати конструктор за замовчанням та 
    конструктор з параметрами.

    Реалізувати наступні методи:
    Move(int x, int y) - рух гравця у вказаному напрямі (задається
            координатами x та y).
    Draw() - виведення гравця на екран у позиції та кольором, які
            вказані у полях класу.


    В основному файлі реалізувати роботу з гравцем через
    клас Player. Додати обробку клавіш W та S для руху
    персонажа вгору та вниз.

     */

    /*
    Додати клас Coin, який описує монету.
     
    Клас має зберігати наступну інформацію:
    — позиція монети;
    - символ, яким буде позначатися монета;
    - колір, яким має виводитись монета (ConsoleColor).

    В класі реалізувати конструктор за замовчанням та 
    конструктор з параметрами.

     Реалізувати наступні методи:
        Draw() - виведення монети на екран у позиції та кольором, які
                вказані у полях класу.


    У клас Player та клас Coin додати властивість Position, яка дозволить 
    отримувати позицію гравця та монети.
     */
}
