namespace CSH_P33.SnakeGame
{
    class Snake
    {
        /*
         * Властивості класу:
         * - Список сегментів змії;
         * - Напрям руху змії (enum з списком напрямів);
         * - Символ голови змії;
         * - Символ тіла змії.
         * 
         * Методи:
         * - Отримати голову змії;
         * - Отримати хвіст змії;
         * - Перевірка зіткнення з тілом змії;
         * - Видалити хвіст;
         * - Оновлення стану змії (Update).
         */
    }

    class Game
    {
        /*
         * Властивості класу:
         * - Розмір поля;
         * - Список точок, в яких знаходиться їжа;
         * - Об'єкт змії;
         * - Прапорець GameOver.
         * 
         * Методи:
         * - Оновлення стану гри (Update);
         * — Малювання гри (Draw);
         * - Зміна напряму руху змії.
         */
    }
}
